MikroElektronika/core_packages/PIC/XC8/def/PIC18LF24K40/mcu.h
extern volatile __bit                   TMR52               __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 TMR52_bit           _BIT_ACCESS(TMR5L,2)
// TMR5L<TMR53>
extern volatile __bit                   TMR53               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 TMR53_bit           _BIT_ACCESS(TMR5L,3)
// TMR5L<TMR54>
extern volatile __bit                   TMR54               __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 TMR54_bit           _BIT_ACCESS(TMR5L,4)
// TMR5L<TMR55>
extern volatile __bit                   TMR55               __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 TMR55_bit           _BIT_ACCESS(TMR5L,5)
// TMR5L<TMR56>
extern volatile __bit                   TMR56               __at(0x7E0E);	// @ (0xFC1 * 8 + 6)
#define                                 TMR56_bit           _BIT_ACCESS(TMR5L,6)
// TMR5L<TMR57>
extern volatile __bit                   TMR57               __at(0x7E0F);	// @ (0xFC1 * 8 + 7)
#define                                 TMR57_bit           _BIT_ACCESS(TMR5L,7)
// TMR5H<TMR58>
extern volatile __bit                   TMR58               __at(0x7E10);	// @ (0xFC2 * 8 + 0)
#define                                 TMR58_bit           _BIT_ACCESS(TMR5H,0)
// TMR5H<TMR59>
extern volatile __bit                   TMR59               __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 TMR59_bit           _BIT_ACCESS(TMR5H,1)
// PIE5<TMR5GIE>
extern volatile __bit                   TMR5GIE             __at(0x763A);	// @ (0xEC7 * 8 + 2)
#define                                 TMR5GIE_bit         _BIT_ACCESS(PIE5,2)
// PIR5<TMR5GIF>
extern volatile __bit                   TMR5GIF             __at(0x767A);	// @ (0xECF * 8 + 2)
#define                                 TMR5GIF_bit         _BIT_ACCESS(PIR5,2)
// IPR5<TMR5GIP>
extern volatile __bit                   TMR5GIP             __at(0x75FA);	// @ (0xEBF * 8 + 2)
#define                                 TMR5GIP_bit         _BIT_ACCESS(IPR5,2)
// TMR5H<TMR5H0>
extern volatile __bit                   TMR5H0              __at(0x7E10);	// @ (0xFC2 * 8 + 0)
#define                                 TMR5H0_bit          _BIT_ACCESS(TMR5H,0)
// TMR5H<TMR5H1>
extern volatile __bit                   TMR5H1              __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 TMR5H1_bit          _BIT_ACCESS(TMR5H,1)
// TMR5H<TMR5H2>
extern volatile __bit                   TMR5H2              __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 TMR5H2_bit          _BIT_ACCESS(TMR5H,2)
// TMR5H<TMR5H3>
extern volatile __bit                   TMR5H3              __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 TMR5H3_bit          _BIT_ACCESS(TMR5H,3)
// TMR5H<TMR5H4>
extern volatile __bit                   TMR5H4              __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 TMR5H4_bit          _BIT_ACCESS(TMR5H,4)
// TMR5H<TMR5H5>
extern volatile __bit                   TMR5H5              __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 TMR5H5_bit          _BIT_ACCESS(TMR5H,5)
// TMR5H<TMR5H6>
extern volatile __bit                   TMR5H6              __at(0x7E16);	// @ (0xFC2 * 8 + 6)
#define                                 TMR5H6_bit          _BIT_ACCESS(TMR5H,6)
// TMR5H<TMR5H7>
extern volatile __bit                   TMR5H7              __at(0x7E17);	// @ (0xFC2 * 8 + 7)
#define                                 TMR5H7_bit          _BIT_ACCESS(TMR5H,7)
// PIE4<TMR5IE>
extern volatile __bit                   TMR5IE              __at(0x7634);	// @ (0xEC6 * 8 + 4)
#define                                 TMR5IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<TMR5IF>
extern volatile __bit                   TMR5IF              __at(0x7674);	// @ (0xECE * 8 + 4)
#define                                 TMR5IF_bit          _BIT_ACCESS(PIR4,4)
// IPR4<TMR5IP>
extern volatile __bit                   TMR5IP              __at(0x75F4);	// @ (0xEBE * 8 + 4)
#define                                 TMR5IP_bit          _BIT_ACCESS(IPR4,4)
// TMR5L<TMR5L0>
extern volatile __bit                   TMR5L0              __at(0x7E08);	// @ (0xFC1 * 8 + 0)
#define                                 TMR5L0_bit          _BIT_ACCESS(TMR5L,0)
// TMR5L<TMR5L1>
extern volatile __bit                   TMR5L1              __at(0x7E09);	// @ (0xFC1 * 8 + 1)
#define                                 TMR5L1_bit          _BIT_ACCESS(TMR5L,1)
// TMR5L<TMR5L2>
extern volatile __bit                   TMR5L2              __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 TMR5L2_bit          _BIT_ACCESS(TMR5L,2)
// TMR5L<TMR5L3>
extern volatile __bit                   TMR5L3              __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 TMR5L3_bit          _BIT_ACCESS(TMR5L,3)
// TMR5L<TMR5L4>
extern volatile __bit                   TMR5L4              __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 TMR5L4_bit          _BIT_ACCESS(TMR5L,4)
// TMR5L<TMR5L5>
extern volatile __bit                   TMR5L5              __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 TMR5L5_bit          _BIT_ACCESS(TMR5L,5)
// TMR5L<TMR5L6>
extern volatile __bit                   TMR5L6              __at(0x7E0E);	// @ (0xFC1 * 8 + 6)
#define                                 TMR5L6_bit          _BIT_ACCESS(TMR5L,6)
// TMR5L<TMR5L7>
extern volatile __bit                   TMR5L7              __at(0x7E0F);	// @ (0xFC1 * 8 + 7)
#define                                 TMR5L7_bit          _BIT_ACCESS(TMR5L,7)
// PMD1<TMR5MD>
extern volatile __bit                   TMR5MD              __at(0x7715);	// @ (0xEE2 * 8 + 5)
#define                                 TMR5MD_bit          _BIT_ACCESS(PMD1,5)
// T5CON<TMR5ON>
extern volatile __bit                   TMR5ON              __at(0x7E18);	// @ (0xFC3 * 8 + 0)
#define                                 TMR5ON_bit          _BIT_ACCESS(T5CON,0)
// PIE4<TMR6IE>
extern volatile __bit                   TMR6IE              __at(0x7635);	// @ (0xEC6 * 8 + 5)
#define                                 TMR6IE_bit          _BIT_ACCESS(PIE4,5)
// PIR4<TMR6IF>
extern volatile __bit                   TMR6IF              __at(0x7675);	// @ (0xECE * 8 + 5)
#define                                 TMR6IF_bit          _BIT_ACCESS(PIR4,5)
// IPR4<TMR6IP>
extern volatile __bit                   TMR6IP              __at(0x75F5);	// @ (0xEBE * 8 + 5)
#define                                 TMR6IP_bit          _BIT_ACCESS(IPR4,5)
// PMD1<TMR6MD>
extern volatile __bit                   TMR6MD              __at(0x7716);	// @ (0xEE2 * 8 + 6)
#define                                 TMR6MD_bit          _BIT_ACCESS(PMD1,6)
// T6CON<TMR6ON>
extern volatile __bit                   TMR6ON              __at(0x7D8F);	// @ (0xFB1 * 8 + 7)
#define                                 TMR6ON_bit          _BIT_ACCESS(T6CON,7)
// STATUS<TO>
extern volatile __bit                   TO                  __at(0x7EC6);	// @ (0xFD8 * 8 + 6)
#define                                 TO_bit              _BIT_ACCESS(STATUS,6)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x7C40);	// @ (0xF88 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x7C41);	// @ (0xF88 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x7C42);	// @ (0xF88 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0x7C43);	// @ (0xF88 * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISA,3)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0x7C44);	// @ (0xF88 * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x7C45);	// @ (0xF88 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISA<TRISA6>
extern volatile __bit                   TRISA6              __at(0x7C46);	// @ (0xF88 * 8 + 6)
#define                                 TRISA6_bit          _BIT_ACCESS(TRISA,6)
// TRISA<TRISA7>
extern volatile __bit                   TRISA7              __at(0x7C47);	// @ (0xF88 * 8 + 7)
#define                                 TRISA7_bit          _BIT_ACCESS(TRISA,7)
// TRISB<TRISB0>
extern volatile __bit                   TRISB0              __at(0x7C48);	// @ (0xF89 * 8 + 0)
#define                                 TRISB0_bit          _BIT_ACCESS(TRISB,0)
// TRISB<TRISB1>
extern volatile __bit                   TRISB1              __at(0x7C49);	// @ (0xF89 * 8 + 1)
#define                                 TRISB1_bit          _BIT_ACCESS(TRISB,1)
// TRISB<TRISB2>
extern volatile __bit                   TRISB2              __at(0x7C4A);	// @ (0xF89 * 8 + 2)
#define                                 TRISB2_bit          _BIT_ACCESS(TRISB,2)
// TRISB<TRISB3>
extern volatile __bit                   TRISB3              __at(0x7C4B);	// @ (0xF89 * 8 + 3)
#define                                 TRISB3_bit          _BIT_ACCESS(TRISB,3)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0x7C4C);	// @ (0xF89 * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0x7C4D);	// @ (0xF89 * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0x7C4E);	// @ (0xF89 * 8 + 6)
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0x7C4F);	// @ (0xF89 * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0x7C50);	// @ (0xF8A * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0x7C51);	// @ (0xF8A * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0x7C52);	// @ (0xF8A * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0x7C53);	// @ (0xF8A * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0x7C54);	// @ (0xF8A * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0x7C55);	// @ (0xF8A * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0x7C56);	// @ (0xF8A * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0x7C57);	// @ (0xF8A * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// TX1STA<TRMT>
extern volatile __bit                   TRMT                __at(0x7CF1);	// @ (0xF9E * 8 + 1)
#define                                 TRMT_bit            _BIT_ACCESS(TX1STA,1)
// TX1STA<TRMT1>
extern volatile __bit                   TRMT1               __at(0x7CF1);	// @ (0xF9E * 8 + 1)
#define                                 TRMT1_bit           _BIT_ACCESS(TX1STA,1)
// SCANTRIG<TSEL0>
extern volatile __bit                   TSEL0               __at(0x7A80);	// @ (0xF50 * 8 + 0)
#define                                 TSEL0_bit           _BIT_ACCESS(SCANTRIG,0)
// SCANTRIG<TSEL1>
extern volatile __bit                   TSEL1               __at(0x7A81);	// @ (0xF50 * 8 + 1)
#define                                 TSEL1_bit           _BIT_ACCESS(SCANTRIG,1)
// SCANTRIG<TSEL2>
extern volatile __bit                   TSEL2               __at(0x7A82);	// @ (0xF50 * 8 + 2)
#define                                 TSEL2_bit           _BIT_ACCESS(SCANTRIG,2)
// SCANTRIG<TSEL3>
extern volatile __bit                   TSEL3               __at(0x7A83);	// @ (0xF50 * 8 + 3)
#define                                 TSEL3_bit           _BIT_ACCESS(SCANTRIG,3)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x798D);	// @ (0xF31 * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x798C);	// @ (0xF31 * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x76E8);	// @ (0xEDD * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x76E9);	// @ (0xEDD * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x76EA);	// @ (0xEDD * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x76EB);	// @ (0xEDD * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x76EC);	// @ (0xEDD * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x76ED);	// @ (0xEDD * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// PIE3<TX1IE>
extern volatile __bit                   TX1IE               __at(0x762C);	// @ (0xEC5 * 8 + 4)
#define                                 TX1IE_bit           _BIT_ACCESS(PIE3,4)
// PIR3<TX1IF>
extern volatile __bit                   TX1IF               __at(0x766C);	// @ (0xECD * 8 + 4)
#define                                 TX1IF_bit           _BIT_ACCESS(PIR3,4)
// CK1PPS<TX1PPS0>
extern volatile __bit                   TX1PPS0             __at(0x75B0);	// @ (0xEB6 * 8 + 0)
#define                                 TX1PPS0_bit         _BIT_ACCESS(CK1PPS,0)
// CK1PPS<TX1PPS1>
extern volatile __bit                   TX1PPS1             __at(0x75B1);	// @ (0xEB6 * 8 + 1)
#define                                 TX1PPS1_bit         _BIT_ACCESS(CK1PPS,1)
// CK1PPS<TX1PPS2>
extern volatile __bit                   TX1PPS2             __at(0x75B2);	// @ (0xEB6 * 8 + 2)
#define                                 TX1PPS2_bit         _BIT_ACCESS(CK1PPS,2)
// CK1PPS<TX1PPS3>
extern volatile __bit                   TX1PPS3             __at(0x75B3);	// @ (0xEB6 * 8 + 3)
#define                                 TX1PPS3_bit         _BIT_ACCESS(CK1PPS,3)
// CK1PPS<TX1PPS4>
extern volatile __bit                   TX1PPS4             __at(0x75B4);	// @ (0xEB6 * 8 + 4)
#define                                 TX1PPS4_bit         _BIT_ACCESS(CK1PPS,4)
// TX1STA<TX8_9>
extern volatile __bit                   TX8_9               __at(0x7CF6);	// @ (0xF9E * 8 + 6)
#define                                 TX8_9_bit           _BIT_ACCESS(TX1STA,6)
// TX1STA<TX9>
extern volatile __bit                   TX9                 __at(0x7CF6);	// @ (0xF9E * 8 + 6)
#define                                 TX9_bit             _BIT_ACCESS(TX1STA,6)
// TX1STA<TX91>
extern volatile __bit                   TX91                __at(0x7CF6);	// @ (0xF9E * 8 + 6)
#define                                 TX91_bit            _BIT_ACCESS(TX1STA,6)
// TX1STA<TX9D>
extern volatile __bit                   TX9D                __at(0x7CF0);	// @ (0xF9E * 8 + 0)
#define                                 TX9D_bit            _BIT_ACCESS(TX1STA,0)
// TX1STA<TX9D1>
extern volatile __bit                   TX9D1               __at(0x7CF0);	// @ (0xF9E * 8 + 0)
#define                                 TX9D1_bit           _BIT_ACCESS(TX1STA,0)
// PIE3<TXB2IE>
extern volatile __bit                   TXB2IE              __at(0x762C);	// @ (0xEC5 * 8 + 4)
#define                                 TXB2IE_bit          _BIT_ACCESS(PIE3,4)
// PIE3<TXBNIE>
extern volatile __bit                   TXBNIE              __at(0x762C);	// @ (0xEC5 * 8 + 4)
#define                                 TXBNIE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TXBNIF>
extern volatile __bit                   TXBNIF              __at(0x766C);	// @ (0xECD * 8 + 4)
#define                                 TXBNIF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TXBNIP>
extern volatile __bit                   TXBNIP              __at(0x75EC);	// @ (0xEBD * 8 + 4)
#define                                 TXBNIP_bit          _BIT_ACCESS(IPR3,4)
// BAUD1CON<TXCKP>
extern volatile __bit                   TXCKP               __at(0x7CFC);	// @ (0xF9F * 8 + 4)
#define                                 TXCKP_bit           _BIT_ACCESS(BAUD1CON,4)
// BAUD1CON<TXCKP1>
extern volatile __bit                   TXCKP1              __at(0x7CFC);	// @ (0xF9F * 8 + 4)
#define                                 TXCKP1_bit          _BIT_ACCESS(BAUD1CON,4)
// TX1STA<TXD8>
extern volatile __bit                   TXD8                __at(0x7CF0);	// @ (0xF9E * 8 + 0)
#define                                 TXD8_bit            _BIT_ACCESS(TX1STA,0)
// TX1STA<TXEN>
extern volatile __bit                   TXEN                __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 TXEN_bit            _BIT_ACCESS(TX1STA,5)
// TX1STA<TXEN1>
extern volatile __bit                   TXEN1               __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 TXEN1_bit           _BIT_ACCESS(TX1STA,5)
// PIE3<TXIE>
extern volatile __bit                   TXIE                __at(0x762C);	// @ (0xEC5 * 8 + 4)
#define                                 TXIE_bit            _BIT_ACCESS(PIE3,4)
// PIR3<TXIF>
extern volatile __bit                   TXIF                __at(0x766C);	// @ (0xECD * 8 + 4)
#define                                 TXIF_bit            _BIT_ACCESS(PIR3,4)
// IPR3<TXIP>
extern volatile __bit                   TXIP                __at(0x75EC);	// @ (0xEBD * 8 + 4)
#define                                 TXIP_bit            _BIT_ACCESS(IPR3,4)
// CK1PPS<TXPPS0>
extern volatile __bit                   TXPPS0              __at(0x75B0);	// @ (0xEB6 * 8 + 0)
#define                                 TXPPS0_bit          _BIT_ACCESS(CK1PPS,0)
// CK1PPS<TXPPS1>
extern volatile __bit                   TXPPS1              __at(0x75B1);	// @ (0xEB6 * 8 + 1)
#define                                 TXPPS1_bit          _BIT_ACCESS(CK1PPS,1)
// CK1PPS<TXPPS2>
extern volatile __bit                   TXPPS2              __at(0x75B2);	// @ (0xEB6 * 8 + 2)
#define                                 TXPPS2_bit          _BIT_ACCESS(CK1PPS,2)
// CK1PPS<TXPPS3>
extern volatile __bit                   TXPPS3              __at(0x75B3);	// @ (0xEB6 * 8 + 3)
#define                                 TXPPS3_bit          _BIT_ACCESS(CK1PPS,3)
// CK1PPS<TXPPS4>
extern volatile __bit                   TXPPS4              __at(0x75B4);	// @ (0xEB6 * 8 + 4)
#define                                 TXPPS4_bit          _BIT_ACCESS(CK1PPS,4)
// SSP1STAT<UA>
extern volatile __bit                   UA                  __at(0x7CA9);	// @ (0xF95 * 8 + 1)
#define                                 UA_bit              _BIT_ACCESS(SSP1STAT,1)
// SSP1STAT<UA1>
extern volatile __bit                   UA1                 __at(0x7CA9);	// @ (0xF95 * 8 + 1)
#define                                 UA1_bit             _BIT_ACCESS(SSP1STAT,1)
// PMD4<UART1MD>
extern volatile __bit                   UART1MD             __at(0x772E);	// @ (0xEE5 * 8 + 6)
#define                                 UART1MD_bit         _BIT_ACCESS(PMD4,6)
// PORTA<ULPWUIN>
extern volatile __bit                   ULPWUIN             __at(0x7C68);	// @ (0xF8D * 8 + 0)
#define                                 ULPWUIN_bit         _BIT_ACCESS(PORTA,0)
// BAUD1CON<W4E>
extern volatile __bit                   W4E                 __at(0x7CF9);	// @ (0xF9F * 8 + 1)
#define                                 W4E_bit             _BIT_ACCESS(BAUD1CON,1)
// SSP1CON1<WCOL>
extern volatile __bit                   WCOL                __at(0x7CB7);	// @ (0xF96 * 8 + 7)
#define                                 WCOL_bit            _BIT_ACCESS(SSP1CON1,7)
// SSP1CON1<WCOL1>
extern volatile __bit                   WCOL1               __at(0x7CB7);	// @ (0xF96 * 8 + 7)
#define                                 WCOL1_bit           _BIT_ACCESS(SSP1CON1,7)
// WDTCON1<WDTCS0>
extern volatile __bit                   WDTCS0              __at(0x769C);	// @ (0xED3 * 8 + 4)
#define                                 WDTCS0_bit          _BIT_ACCESS(WDTCON1,4)
// WDTCON1<WDTCS1>
extern volatile __bit                   WDTCS1              __at(0x769D);	// @ (0xED3 * 8 + 5)
#define                                 WDTCS1_bit          _BIT_ACCESS(WDTCON1,5)
// WDTCON1<WDTCS2>
extern volatile __bit                   WDTCS2              __at(0x769E);	// @ (0xED3 * 8 + 6)
#define                                 WDTCS2_bit          _BIT_ACCESS(WDTCON1,6)
// WDTCON0<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0x7691);	// @ (0xED2 * 8 + 1)
#define                                 WDTPS0_bit          _BIT_ACCESS(WDTCON0,1)
// WDTCON0<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0x7692);	// @ (0xED2 * 8 + 2)
#define                                 WDTPS1_bit          _BIT_ACCESS(WDTCON0,2)
// WDTCON0<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0x7693);	// @ (0xED2 * 8 + 3)
#define                                 WDTPS2_bit          _BIT_ACCESS(WDTCON0,3)
// WDTCON0<WDTPS3>
extern volatile __bit                   WDTPS3              __at(0x7694);	// @ (0xED2 * 8 + 4)
#define                                 WDTPS3_bit          _BIT_ACCESS(WDTCON0,4)
// WDTCON0<WDTPS4>
extern volatile __bit                   WDTPS4              __at(0x7695);	// @ (0xED2 * 8 + 5)
#define                                 WDTPS4_bit          _BIT_ACCESS(WDTCON0,5)
// WDTPSL<WDTPSCNT0>
extern volatile __bit                   WDTPSCNT0           __at(0x76A0);	// @ (0xED4 * 8 + 0)
#define                                 WDTPSCNT0_bit       _BIT_ACCESS(WDTPSL,0)
// WDTPSL<WDTPSCNT1>
extern volatile __bit                   WDTPSCNT1           __at(0x76A1);	// @ (0xED4 * 8 + 1)
#define                                 WDTPSCNT1_bit       _BIT_ACCESS(WDTPSL,1)
// WDTPSH<WDTPSCNT10>
extern volatile __bit                   WDTPSCNT10          __at(0x76AA);	// @ (0xED5 * 8 + 2)
#define                                 WDTPSCNT10_bit      _BIT_ACCESS(WDTPSH,2)
// WDTPSH<WDTPSCNT11>
extern volatile __bit                   WDTPSCNT11          __at(0x76AB);	// @ (0xED5 * 8 + 3)
